{
	"title": "Ben Williamson2",
	"image": "blt696270a51d1460d3",
	"position": "Business Development Executive | Product Experience & Engineering Lab | New York",
	"experience": "25 years",
	"details": "<p>Digital innovation requires orchestrating talented technologists, embracing modern approaches, and balancing customer needs with complex organizational dynamics. That’s where Ben comes in. He has a track record for market-moving applications with tangible impact: A digital product that produces eight-figure annual revenue for a legal information publisher, a biological entity management system that shortens drug development time for a biotech company with 1,200 research scientists. And an eCommerce site that supports $600 million in annual online sales for one of North America’s oldest retailers—delivered in time to enable a 40% jump in sales on Black Friday.\n\n<br/>Ben credits these types of successes to professional—and life—principles that are centered on transparency, passionate curiosity, empathy on an individual level, and pragmatic efficiency on an organizational level.&nbsp;\n\n<br/>Ben joined West Monroe in 2024. Previously, he was vice president responsible for client growth and success for a global software consultancy and services firm—for which he authored the Modern Digital Organization Manifesto. He earned a degree in business/marketing from Miami University.</p><h2>What makes Ben different</h2><p>Ben’s a red wine enthusiast, a fan of live music, and a loyal supporter of Cleveland’s challenged sports teams. He’s also a runner who has participated in the New York City and Philadelphia marathons. While lefties represent only 10% of the population, they make up 100% of Ben’s immediate family.&nbsp;\n\n<br/>Over the course of his career, he has traveled to and spent time for work in Sri Lanka, the Philippines, India, Brazil, and much of Europe.</p><h2>Where Ben makes an impact</h2><p>Ben takes pride in supporting colleagues’ professional development, including helping them find opportunities to excel and grow their own capabilities.&nbsp;\n\n<br/>For two decades, he has been a Rotarian—a volunteer with and member of the world’s largest service organization. He has served on his Rotary Club board for over a decade.</p>",
	"linkedin": {
		"title": "",
		"href": "https://www.linkedin.com/in/benwilliamson1/"
	},
	"tags": [],
	"locale": "en-us",
	"uid": "blt81d84ff56ee0e484",
	"created_by": "",
	"updated_by": "",
	"created_at": "2024-05-14T20:32:34.527Z",
	"updated_at": "2024-05-14T20:35:32.099Z",
	"_version": "",
	"_in_progress": false

}
